config.org
#+PROPERTY: header-args:emacs-lisp :comments both :results discard silent

* Early Configuration
:PROPERTIES:
:header-args:emacs-lisp+: :tangle "early-init.el"
:END:

We put some configuration options into early-init.el.

** Garbage Collection

We effectively disable garbage collection while Emacs is starting up by setting the threshold to 1 GiB. This famous hack cuts startup time in half. This section should be located as high as possible in the file so that other commands do not trigger garbage collection. Later on, ~gcmh~ will re-enable garbage collection in idle periods.

#+BEGIN_src emacs-lisp
  (setq gc-cons-threshold #x40000000)
#+end_src

** The rest

#+begin_src emacs-lisp
  ;; Disable built-in package.el.
  (setq package-enable-at-startup nil)


  (setcar native-comp-eln-load-path
          (expand-file-name ".local/cache/eln" user-emacs-directory))

  (setq inhibit-startup-screen t)

  ;; Let it be maximized.
  (setq initial-frame-alist '((fullscreen . maximized)))

  ;; No menu bar, toolbar, scroll bar.
  (setq default-frame-alist
        '((menu-bar-lines . 0)
          (tool-bar-lines . 0)
          (horizontal-scroll-bars)
          (vertical-scroll-bars)))

  (set-face-attribute 'default nil :font "Fira Code")
  (set-face-attribute 'fixed-pitch nil :font "Fira Code")
  (set-face-attribute 'variable-pitch nil :font "Fira Sans")
  (set-fontset-font t 'symbol "Noto Color Emoji")
  (set-fontset-font t 'symbol "Symbola" nil 'append)

  (add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))
  ;; (require 'elpaca-bootstrap)
  ;; (require 'tig-lib)
#+END_src

* General Configuration
:PROPERTIES:
:header-args:emacs-lisp+: :tangle "init.el"
:END:

Most of the configuration goes into init.el.

** Literate Config Goodies

TODO move to use-package for org-mode or org-babel

#+begin_src emacs-lisp
  (defun arete--post-tangle ()
    (message "adjusting tangled file")
    (cond
     ((f-ext? (buffer-file-name) "el")
      (add-file-local-variable-prop-line "lexical-binding" t)))
    (save-buffer))
  ;; (defun arete--literate-init ()
    ;; (make-local-variable 'org-babel-post-tangle-hook)
  ;; (add-hook 'org-babel-post-tangle-hook 'arete--literate-post-tangle nil t)
  (add-hook 'org-babel-post-tangle-hook 'arete--post-tangle)
    ;; )
  ;; (put 'arete--literate-init 'safe-local-eval-function t)
#+end_src

** Use-Package

Enable ~use-package~ statements navigation via ~imenu~. This also includes ~consult-imenu~.

#+begin_src emacs-lisp
  (setopt use-package-enable-imenu-support t)
#+end_src

Tell ~use-package~ to always load features lazily unless told otherwise. It's nicer to have this kind of thing be deterministic: if ~:demand~ is present, the loading is eager; otherwise, the loading is lazy. See https://github.com/jwiegley/use-package#notes-about-lazy-loading.

#+begin_src emacs-lisp
  (setopt use-package-always-defer t)
#+end_src

Built-in features should be configured with ~use-feature~, so that a package manager wouldn't bother to install them. And direct ~use-package~ calls will install packages if not found.

#+begin_src emacs-lisp
  (setopt use-package-always-ensure t)

  (defmacro use-feature (name &rest args)
    "`use-package' that makes sure `ensure' is disabled."
    (declare (indent defun))
    `(use-package ,name
       :ensure nil
       ,@args))
#+end_src

** Elpaca

*** Bootstrap

#+begin_src emacs-lisp
  (defvar elpaca-installer-version 0.7)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil :depth 1
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (< emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                   ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                   ,@(when-let ((depth (plist-get order :depth)))
                                                       (list (format "--depth=%d" depth) "--no-single-branch"))
                                                   ,(plist-get order :repo) ,repo))))
                   ((zerop (call-process "git" nil buffer t "checkout"
                                         (or (plist-get order :ref) "--"))))
                   (emacs (concat invocation-directory invocation-name))
                   ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                         "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                   ((require 'elpaca))
                   ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (load "./elpaca-autoloads")))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))
#+end_src

*** Elpaca Configuration

#+begin_src emacs-lisp
  (elpaca elpaca-use-package (elpaca-use-package-mode))
  (elpaca-wait)
#+end_src

** Garbage Collection Magic Hack

#+begin_src emacs-lisp
  (use-package gcmh
    :custom
    (gcmh-mode t))
#+end_src

