config.org
** Org Mode

#+begin_src emacs-lisp
  (use-feature org
    :hook (org-mode . visual-line-mode)
    :general
    (:prefix-command 'arete-notes-menu-map
                     "a" '("Agenda" . org-agenda))
    :custom
    (org-directory "~/cloud/mobile/org")
    (org-support-shift-select t)
    (org-startup-indented t)
    (org-catch-invisible-edits 'show-and-error)
    ;; hide the emphasis markup (e.g. /.../ for italics, *...* for bold, etc.)
    (org-hide-emphasis-markers t)
    ;; formats sub- and superscripts in a WYSIWYM way
    (org-pretty-entities t)
    ;; uses to indicate hidden content
    (org-ellipsis "…")
    :config
    (general-def arete-menu-map "n" '("Notes" . arete-notes-menu-map)))
#+end_src

Inline tasks are disabled by default, although they seem very useful for quickly defining small tasks without introducing a first-class header. Technically, they are defined as headers, but deeply nested. Try out by running ~org-inlinetask-insert-task~ on an empty line.

#+begin_src emacs-lisp
  (use-feature org-inlinetask :demand t)
#+end_src

*** Look And Feel

**** Org Modern

#+begin_src emacs-lisp
  (use-package org-modern
    :after org
    :custom
    (org-modern-block-name '(("src" "λ" "λ")))
    :hook ((org-mode . org-modern-mode)
           (org-agenda-finalize . org-modern-agenda))
    :custom
    (org-modern-star '("🞴" "🞳" "🞲" "🞱" "🞰"))
    ;; modern tags are auto-misaligned
    (org-auto-align-tags nil)
    (org-tags-column 0)
    :config
    ;; The default face reduces the size of block names,
    ;; but we want the whole block line to be smaller than normal lines,
    ;; so without this setting block names would be twice smaller.
    (face-spec-set 'org-modern-block-name nil 'face-defface-spec)
    (face-spec-set 'org-modern-done
                   '((t :inherit (org-done org-modern-label) :inverse-video t))
                   'face-defface-spec)
    (face-spec-set 'org-modern-tag
                   '((t :inherit (org-tag org-modern-label) :inverse-video t))
                   'face-defface-spec))
#+end_src

**** Org Modern Indent

#+begin_src emacs-lisp
  (use-package org-modern-indent
    :ensure (:host github :repo "jdtsmith/org-modern-indent")
    :after org
    :hook ('org-mode . org-modern-indent-mode))
#+end_src

*** Org Roam

#+begin_src emacs-lisp
  (defun +org-roam/format-width-a (node template)
    "Advice that fixes two issues with format functions:
  1. They incorrectly set width for minibuffer completion.
  See https://github.com/org-roam/org-roam/issues/2066.
  2. When one field has '*' width and another doesn't have specified width,
  the resulting string becomes wider than needed."
    (let* ((width (if (minibufferp) (window-width) (frame-width)))
           (candidate (org-roam-node--format-entry template node width))
           (adjustment (- width (string-width candidate)))
           (candidate-main
            (org-roam-node--format-entry template node (+ width adjustment))))
      (cons (propertize candidate-main 'node node) node)))

  (use-package org-roam
    :after org
    :general
    (:prefix-command 'arete-roam-menu-map
                     "f" '("Find node" . org-roam-node-find)
                     "i" '("Insert node" . org-roam-insert)
                     "r" '("Toggle roam buffer" . org-roam-buffer-toggle))
    (:prefix-command 'arete-dailies-menu-map
                     "t" '("Goto today" . org-roam-dailies-goto-today)
                     "m" '("Goto tomorrow" . org-roam-dailies-goto-tomorrow)
                     "y" '("Goto yesterday" . org-roam-dailies-goto-yesterday))
    :custom
    (org-roam-directory "~/cloud/mobile/org")
    (org-roam-dailies-directory "logbook")
    (org-roam-completion-everywhere t)
    (org-roam-node-display-template
     (concat "${title:*} " (propertize "${tags}" 'face 'org-tag)))
    :init
    (general-def arete-notes-menu-map "r" '("Roam" . arete-roam-menu-map))
    (general-def arete-notes-menu-map "d" '("Dailies" . arete-dailies-menu-map))
    :config
    (advice-add 'org-roam-node-read--to-candidate
                :override '+org-roam/format-width-a)
    (org-roam-db-autosync-mode t))
#+end_src

**** Consult Org Roam

Enable live preview for org-roam commands.

*************** TODO Explore other consult-org-roam options

#+begin_src emacs-lisp
  (use-package consult-org-roam
    :after org-roam
    :custom
    (consult-org-roam-mode t))
#+end_src
