init.el
		   "a" '("Agenda" . org-agenda))
  :custom
  (org-directory "~/cloud/mobile/org")
  :config
  (general-def arete-menu-map "n" '("Notes" . arete-notes-menu-map)))

(defun +org-roam/format-width-a (node template)
  "Advice that fixes two issues with format functions:
1. They incorrectly set width for minibuffer completion.
See https://github.com/org-roam/org-roam/issues/2066.
2. When one field has '*' width and another doesn't have specified width,
the resulting string becomes wider than needed."
  (let* ((width (if (minibufferp) (window-width) (frame-width)))
	 (candidate (org-roam-node--format-entry template node width))
	 (adjustment (- width (string-width candidate)))
	 (candidate-main
	  (org-roam-node--format-entry template node (+ width adjustment))))
    (cons (propertize candidate-main 'node node) node)))

(use-package org-roam
  :elpaca t
  :after org
  :general
  (:prefix-command 'arete-roam-menu-map
   "f" '("Find node" . org-roam-node-find)
   "i" '("Insert node" . org-roam-insert)
   "r" '("Toggle roam buffer" . org-roam-buffer-toggle))
  (:prefix-command 'arete-dailies-menu-map
		   "t" '("Goto today" . org-roam-dailies-goto-today)
		   "m" '("Goto tomorrow" . org-roam-dailies-goto-tomorrow)
		   "y" '("Goto yesterday" . org-roam-dailies-goto-yesterday))
  :custom
  (org-roam-directory "~/cloud/mobile/org")
  (org-roam-dailies-directory "logbook")
  (org-roam-completion-everywhere t)
  (org-roam-node-display-template
   (concat "${title:*} " (propertize "${tags}" 'face 'org-tag)))
  :init
  (general-def arete-notes-menu-map "r" '("Roam" . arete-roam-menu-map))
  (general-def arete-notes-menu-map "d" '("Dailies" . arete-dailies-menu-map))
  :config
  (advice-add 'org-roam-node-read--to-candidate
	      :override '+org-roam/format-width-a)
  (org-roam-db-autosync-mode t))

(use-package consult-org-roam
  :elpaca t
  :after org-roam
  :init
  ;; It enables live preview for org-roam commands.
  (setopt consult-org-roam-mode t))

(use-package edebug
  :no-require
  :general
  ;; Default key binding uses SPC.
  (edebug-mode-map "s" 'edebug-step-mode))
